Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxDma_reg.h
/** \brief 1970, DMA Channel 92 Resource Partition Register */
#define DMA_HRR92 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011970u)
/** Alias (User Manual Name) for DMA_HRR92.
* To use register names with standard convension, please use DMA_HRR92.
*/
#define DMA_HRR092 (DMA_HRR92)

/** \brief 1974, DMA Channel 93 Resource Partition Register */
#define DMA_HRR93 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011974u)
/** Alias (User Manual Name) for DMA_HRR93.
* To use register names with standard convension, please use DMA_HRR93.
*/
#define DMA_HRR093 (DMA_HRR93)

/** \brief 1978, DMA Channel 94 Resource Partition Register */
#define DMA_HRR94 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011978u)
/** Alias (User Manual Name) for DMA_HRR94.
* To use register names with standard convension, please use DMA_HRR94.
*/
#define DMA_HRR094 (DMA_HRR94)

/** \brief 197C, DMA Channel 95 Resource Partition Register */
#define DMA_HRR95 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001197Cu)
/** Alias (User Manual Name) for DMA_HRR95.
* To use register names with standard convension, please use DMA_HRR95.
*/
#define DMA_HRR095 (DMA_HRR95)

/** \brief 1980, DMA Channel 96 Resource Partition Register */
#define DMA_HRR96 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011980u)
/** Alias (User Manual Name) for DMA_HRR96.
* To use register names with standard convension, please use DMA_HRR96.
*/
#define DMA_HRR096 (DMA_HRR96)

/** \brief 1984, DMA Channel 97 Resource Partition Register */
#define DMA_HRR97 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011984u)
/** Alias (User Manual Name) for DMA_HRR97.
* To use register names with standard convension, please use DMA_HRR97.
*/
#define DMA_HRR097 (DMA_HRR97)

/** \brief 1988, DMA Channel 98 Resource Partition Register */
#define DMA_HRR98 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011988u)
/** Alias (User Manual Name) for DMA_HRR98.
* To use register names with standard convension, please use DMA_HRR98.
*/
#define DMA_HRR098 (DMA_HRR98)

/** \brief 198C, DMA Channel 99 Resource Partition Register */
#define DMA_HRR99 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001198Cu)
/** Alias (User Manual Name) for DMA_HRR99.
* To use register names with standard convension, please use DMA_HRR99.
*/
#define DMA_HRR099 (DMA_HRR99)

/** \brief 1990, DMA Channel 100 Resource Partition Register */
#define DMA_HRR100 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011990u)

/** \brief 1994, DMA Channel 101 Resource Partition Register */
#define DMA_HRR101 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011994u)

/** \brief 1998, DMA Channel 102 Resource Partition Register */
#define DMA_HRR102 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011998u)

/** \brief 199C, DMA Channel 103 Resource Partition Register */
#define DMA_HRR103 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001199Cu)

/** \brief 19A0, DMA Channel 104 Resource Partition Register */
#define DMA_HRR104 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119A0u)

/** \brief 19A4, DMA Channel 105 Resource Partition Register */
#define DMA_HRR105 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119A4u)

/** \brief 19A8, DMA Channel 106 Resource Partition Register */
#define DMA_HRR106 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119A8u)

/** \brief 19AC, DMA Channel 107 Resource Partition Register */
#define DMA_HRR107 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119ACu)

/** \brief 19B0, DMA Channel 108 Resource Partition Register */
#define DMA_HRR108 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119B0u)

/** \brief 19B4, DMA Channel 109 Resource Partition Register */
#define DMA_HRR109 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119B4u)

/** \brief 19B8, DMA Channel 110 Resource Partition Register */
#define DMA_HRR110 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119B8u)

/** \brief 19BC, DMA Channel 111 Resource Partition Register */
#define DMA_HRR111 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119BCu)

/** \brief 19C0, DMA Channel 112 Resource Partition Register */
#define DMA_HRR112 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119C0u)

/** \brief 19C4, DMA Channel 113 Resource Partition Register */
#define DMA_HRR113 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119C4u)

/** \brief 19C8, DMA Channel 114 Resource Partition Register */
#define DMA_HRR114 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119C8u)

/** \brief 19CC, DMA Channel 115 Resource Partition Register */
#define DMA_HRR115 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119CCu)

/** \brief 19D0, DMA Channel 116 Resource Partition Register */
#define DMA_HRR116 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119D0u)

/** \brief 19D4, DMA Channel 117 Resource Partition Register */
#define DMA_HRR117 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119D4u)

/** \brief 19D8, DMA Channel 118 Resource Partition Register */
#define DMA_HRR118 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119D8u)

/** \brief 19DC, DMA Channel 119 Resource Partition Register */
#define DMA_HRR119 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119DCu)

/** \brief 19E0, DMA Channel 120 Resource Partition Register */
#define DMA_HRR120 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119E0u)

/** \brief 19E4, DMA Channel 121 Resource Partition Register */
#define DMA_HRR121 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119E4u)

/** \brief 19E8, DMA Channel 122 Resource Partition Register */
#define DMA_HRR122 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119E8u)

/** \brief 19EC, DMA Channel 123 Resource Partition Register */
#define DMA_HRR123 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119ECu)

/** \brief 19F0, DMA Channel 124 Resource Partition Register */
#define DMA_HRR124 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119F0u)

/** \brief 19F4, DMA Channel 125 Resource Partition Register */
#define DMA_HRR125 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00119F4u)

