Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxDma_reg.h
/** \brief 291C, DMARAM Channel 72 Control and Status Register */
#define DMA_CH72_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001291Cu)
/** Alias (User Manual Name) for DMA_CH72_CHCSR.
* To use register names with standard convension, please use DMA_CH72_CHCSR.
*/
#define DMA_CHCSR072 (DMA_CH72_CHCSR)

/** \brief 2920, DMARAM Channel 73 Read Data CRC Register */
#define DMA_CH73_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012920u)
/** Alias (User Manual Name) for DMA_CH73_RDCRCR.
* To use register names with standard convension, please use DMA_CH73_RDCRCR.
*/
#define DMA_RDCRCR073 (DMA_CH73_RDCRCR)

/** \brief 2924, DMARAM Channel 73 Source and Destination Address CRC Register */
#define DMA_CH73_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012924u)
/** Alias (User Manual Name) for DMA_CH73_SDCRCR.
* To use register names with standard convension, please use DMA_CH73_SDCRCR.
*/
#define DMA_SDCRCR073 (DMA_CH73_SDCRCR)

/** \brief 2928, DMARAM Channel 73 Source Address Register */
#define DMA_CH73_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012928u)
/** Alias (User Manual Name) for DMA_CH73_SADR.
* To use register names with standard convension, please use DMA_CH73_SADR.
*/
#define DMA_SADR073 (DMA_CH73_SADR)

/** \brief 292C, DMARAM Channel 73 Destination Address Register */
#define DMA_CH73_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001292Cu)
/** Alias (User Manual Name) for DMA_CH73_DADR.
* To use register names with standard convension, please use DMA_CH73_DADR.
*/
#define DMA_DADR073 (DMA_CH73_DADR)

/** \brief 2930, DMARAM Channel 73 Address and Interrupt Control Register */
#define DMA_CH73_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012930u)
/** Alias (User Manual Name) for DMA_CH73_ADICR.
* To use register names with standard convension, please use DMA_CH73_ADICR.
*/
#define DMA_ADICR073 (DMA_CH73_ADICR)

/** \brief 2934, DMARAM Channel 73 Configuration Register */
#define DMA_CH73_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012934u)
/** Alias (User Manual Name) for DMA_CH73_CHCFGR.
* To use register names with standard convension, please use DMA_CH73_CHCFGR.
*/
#define DMA_CHCFGR073 (DMA_CH73_CHCFGR)

/** \brief 2938, DMARAM Channel 73 Shadow Address Register */
#define DMA_CH73_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012938u)
/** Alias (User Manual Name) for DMA_CH73_SHADR.
* To use register names with standard convension, please use DMA_CH73_SHADR.
*/
#define DMA_SHADR073 (DMA_CH73_SHADR)

/** \brief 293C, DMARAM Channel 73 Control and Status Register */
#define DMA_CH73_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001293Cu)
/** Alias (User Manual Name) for DMA_CH73_CHCSR.
* To use register names with standard convension, please use DMA_CH73_CHCSR.
*/
#define DMA_CHCSR073 (DMA_CH73_CHCSR)

/** \brief 2940, DMARAM Channel 74 Read Data CRC Register */
#define DMA_CH74_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012940u)
/** Alias (User Manual Name) for DMA_CH74_RDCRCR.
* To use register names with standard convension, please use DMA_CH74_RDCRCR.
*/
#define DMA_RDCRCR074 (DMA_CH74_RDCRCR)

/** \brief 2944, DMARAM Channel 74 Source and Destination Address CRC Register */
#define DMA_CH74_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012944u)
/** Alias (User Manual Name) for DMA_CH74_SDCRCR.
* To use register names with standard convension, please use DMA_CH74_SDCRCR.
*/
#define DMA_SDCRCR074 (DMA_CH74_SDCRCR)

/** \brief 2948, DMARAM Channel 74 Source Address Register */
#define DMA_CH74_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012948u)
/** Alias (User Manual Name) for DMA_CH74_SADR.
* To use register names with standard convension, please use DMA_CH74_SADR.
*/
#define DMA_SADR074 (DMA_CH74_SADR)

/** \brief 294C, DMARAM Channel 74 Destination Address Register */
#define DMA_CH74_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001294Cu)
/** Alias (User Manual Name) for DMA_CH74_DADR.
* To use register names with standard convension, please use DMA_CH74_DADR.
*/
#define DMA_DADR074 (DMA_CH74_DADR)

/** \brief 2950, DMARAM Channel 74 Address and Interrupt Control Register */
#define DMA_CH74_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012950u)
/** Alias (User Manual Name) for DMA_CH74_ADICR.
* To use register names with standard convension, please use DMA_CH74_ADICR.
*/
#define DMA_ADICR074 (DMA_CH74_ADICR)

/** \brief 2954, DMARAM Channel 74 Configuration Register */
#define DMA_CH74_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012954u)
/** Alias (User Manual Name) for DMA_CH74_CHCFGR.
* To use register names with standard convension, please use DMA_CH74_CHCFGR.
*/
#define DMA_CHCFGR074 (DMA_CH74_CHCFGR)

/** \brief 2958, DMARAM Channel 74 Shadow Address Register */
#define DMA_CH74_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012958u)
/** Alias (User Manual Name) for DMA_CH74_SHADR.
* To use register names with standard convension, please use DMA_CH74_SHADR.
*/
#define DMA_SHADR074 (DMA_CH74_SHADR)

/** \brief 295C, DMARAM Channel 74 Control and Status Register */
#define DMA_CH74_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001295Cu)
/** Alias (User Manual Name) for DMA_CH74_CHCSR.
* To use register names with standard convension, please use DMA_CH74_CHCSR.
*/
#define DMA_CHCSR074 (DMA_CH74_CHCSR)

/** \brief 2960, DMARAM Channel 75 Read Data CRC Register */
#define DMA_CH75_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012960u)
/** Alias (User Manual Name) for DMA_CH75_RDCRCR.
* To use register names with standard convension, please use DMA_CH75_RDCRCR.
*/
#define DMA_RDCRCR075 (DMA_CH75_RDCRCR)

/** \brief 2964, DMARAM Channel 75 Source and Destination Address CRC Register */
#define DMA_CH75_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012964u)
/** Alias (User Manual Name) for DMA_CH75_SDCRCR.
* To use register names with standard convension, please use DMA_CH75_SDCRCR.
*/
#define DMA_SDCRCR075 (DMA_CH75_SDCRCR)

