Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxDma_reg.h
/** \brief 2D38, DMARAM Channel 105 Shadow Address Register */
#define DMA_CH105_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D38u)
/** Alias (User Manual Name) for DMA_CH105_SHADR.
* To use register names with standard convension, please use DMA_CH105_SHADR.
*/
#define DMA_SHADR105 (DMA_CH105_SHADR)

/** \brief 2D3C, DMARAM Channel 105 Control and Status Register */
#define DMA_CH105_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D3Cu)
/** Alias (User Manual Name) for DMA_CH105_CHCSR.
* To use register names with standard convension, please use DMA_CH105_CHCSR.
*/
#define DMA_CHCSR105 (DMA_CH105_CHCSR)

/** \brief 2D40, DMARAM Channel 106 Read Data CRC Register */
#define DMA_CH106_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D40u)
/** Alias (User Manual Name) for DMA_CH106_RDCRCR.
* To use register names with standard convension, please use DMA_CH106_RDCRCR.
*/
#define DMA_RDCRCR106 (DMA_CH106_RDCRCR)

/** \brief 2D44, DMARAM Channel 106 Source and Destination Address CRC Register */
#define DMA_CH106_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D44u)
/** Alias (User Manual Name) for DMA_CH106_SDCRCR.
* To use register names with standard convension, please use DMA_CH106_SDCRCR.
*/
#define DMA_SDCRCR106 (DMA_CH106_SDCRCR)

/** \brief 2D48, DMARAM Channel 106 Source Address Register */
#define DMA_CH106_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D48u)
/** Alias (User Manual Name) for DMA_CH106_SADR.
* To use register names with standard convension, please use DMA_CH106_SADR.
*/
#define DMA_SADR106 (DMA_CH106_SADR)

/** \brief 2D4C, DMARAM Channel 106 Destination Address Register */
#define DMA_CH106_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D4Cu)
/** Alias (User Manual Name) for DMA_CH106_DADR.
* To use register names with standard convension, please use DMA_CH106_DADR.
*/
#define DMA_DADR106 (DMA_CH106_DADR)

/** \brief 2D50, DMARAM Channel 106 Address and Interrupt Control Register */
#define DMA_CH106_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D50u)
/** Alias (User Manual Name) for DMA_CH106_ADICR.
* To use register names with standard convension, please use DMA_CH106_ADICR.
*/
#define DMA_ADICR106 (DMA_CH106_ADICR)

/** \brief 2D54, DMARAM Channel 106 Configuration Register */
#define DMA_CH106_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D54u)
/** Alias (User Manual Name) for DMA_CH106_CHCFGR.
* To use register names with standard convension, please use DMA_CH106_CHCFGR.
*/
#define DMA_CHCFGR106 (DMA_CH106_CHCFGR)

/** \brief 2D58, DMARAM Channel 106 Shadow Address Register */
#define DMA_CH106_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D58u)
/** Alias (User Manual Name) for DMA_CH106_SHADR.
* To use register names with standard convension, please use DMA_CH106_SHADR.
*/
#define DMA_SHADR106 (DMA_CH106_SHADR)

/** \brief 2D5C, DMARAM Channel 106 Control and Status Register */
#define DMA_CH106_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D5Cu)
/** Alias (User Manual Name) for DMA_CH106_CHCSR.
* To use register names with standard convension, please use DMA_CH106_CHCSR.
*/
#define DMA_CHCSR106 (DMA_CH106_CHCSR)

/** \brief 2D60, DMARAM Channel 107 Read Data CRC Register */
#define DMA_CH107_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D60u)
/** Alias (User Manual Name) for DMA_CH107_RDCRCR.
* To use register names with standard convension, please use DMA_CH107_RDCRCR.
*/
#define DMA_RDCRCR107 (DMA_CH107_RDCRCR)

/** \brief 2D64, DMARAM Channel 107 Source and Destination Address CRC Register */
#define DMA_CH107_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D64u)
/** Alias (User Manual Name) for DMA_CH107_SDCRCR.
* To use register names with standard convension, please use DMA_CH107_SDCRCR.
*/
#define DMA_SDCRCR107 (DMA_CH107_SDCRCR)

/** \brief 2D68, DMARAM Channel 107 Source Address Register */
#define DMA_CH107_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D68u)
/** Alias (User Manual Name) for DMA_CH107_SADR.
* To use register names with standard convension, please use DMA_CH107_SADR.
*/
#define DMA_SADR107 (DMA_CH107_SADR)

/** \brief 2D6C, DMARAM Channel 107 Destination Address Register */
#define DMA_CH107_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D6Cu)
/** Alias (User Manual Name) for DMA_CH107_DADR.
* To use register names with standard convension, please use DMA_CH107_DADR.
*/
#define DMA_DADR107 (DMA_CH107_DADR)

/** \brief 2D70, DMARAM Channel 107 Address and Interrupt Control Register */
#define DMA_CH107_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D70u)
/** Alias (User Manual Name) for DMA_CH107_ADICR.
* To use register names with standard convension, please use DMA_CH107_ADICR.
*/
#define DMA_ADICR107 (DMA_CH107_ADICR)

/** \brief 2D74, DMARAM Channel 107 Configuration Register */
#define DMA_CH107_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D74u)
/** Alias (User Manual Name) for DMA_CH107_CHCFGR.
* To use register names with standard convension, please use DMA_CH107_CHCFGR.
*/
#define DMA_CHCFGR107 (DMA_CH107_CHCFGR)

/** \brief 2D78, DMARAM Channel 107 Shadow Address Register */
#define DMA_CH107_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D78u)
/** Alias (User Manual Name) for DMA_CH107_SHADR.
* To use register names with standard convension, please use DMA_CH107_SHADR.
*/
#define DMA_SHADR107 (DMA_CH107_SHADR)

/** \brief 2D7C, DMARAM Channel 107 Control and Status Register */
#define DMA_CH107_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D7Cu)
/** Alias (User Manual Name) for DMA_CH107_CHCSR.
* To use register names with standard convension, please use DMA_CH107_CHCSR.
*/
#define DMA_CHCSR107 (DMA_CH107_CHCSR)

/** \brief 2D80, DMARAM Channel 108 Read Data CRC Register */
#define DMA_CH108_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D80u)
/** Alias (User Manual Name) for DMA_CH108_RDCRCR.
* To use register names with standard convension, please use DMA_CH108_RDCRCR.
*/
#define DMA_RDCRCR108 (DMA_CH108_RDCRCR)

/** \brief 2D84, DMARAM Channel 108 Source and Destination Address CRC Register */
#define DMA_CH108_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D84u)
/** Alias (User Manual Name) for DMA_CH108_SDCRCR.
* To use register names with standard convension, please use DMA_CH108_SDCRCR.
*/
#define DMA_SDCRCR108 (DMA_CH108_SDCRCR)

/** \brief 2D88, DMARAM Channel 108 Source Address Register */
#define DMA_CH108_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D88u)
/** Alias (User Manual Name) for DMA_CH108_SADR.
* To use register names with standard convension, please use DMA_CH108_SADR.
*/
#define DMA_SADR108 (DMA_CH108_SADR)

/** \brief 2D8C, DMARAM Channel 108 Destination Address Register */
#define DMA_CH108_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D8Cu)
/** Alias (User Manual Name) for DMA_CH108_DADR.
* To use register names with standard convension, please use DMA_CH108_DADR.
*/
#define DMA_DADR108 (DMA_CH108_DADR)

/** \brief 2D90, DMARAM Channel 108 Address and Interrupt Control Register */
#define DMA_CH108_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D90u)
/** Alias (User Manual Name) for DMA_CH108_ADICR.
* To use register names with standard convension, please use DMA_CH108_ADICR.
*/
#define DMA_ADICR108 (DMA_CH108_ADICR)

/** \brief 2D94, DMARAM Channel 108 Configuration Register */
#define DMA_CH108_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D94u)
/** Alias (User Manual Name) for DMA_CH108_CHCFGR.
* To use register names with standard convension, please use DMA_CH108_CHCFGR.
*/
#define DMA_CHCFGR108 (DMA_CH108_CHCFGR)

