Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxDma_reg.h
/** \brief 2D98, DMARAM Channel 108 Shadow Address Register */
#define DMA_CH108_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D98u)
/** Alias (User Manual Name) for DMA_CH108_SHADR.
* To use register names with standard convension, please use DMA_CH108_SHADR.
*/
#define DMA_SHADR108 (DMA_CH108_SHADR)

/** \brief 2D9C, DMARAM Channel 108 Control and Status Register */
#define DMA_CH108_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D9Cu)
/** Alias (User Manual Name) for DMA_CH108_CHCSR.
* To use register names with standard convension, please use DMA_CH108_CHCSR.
*/
#define DMA_CHCSR108 (DMA_CH108_CHCSR)

/** \brief 2DA0, DMARAM Channel 109 Read Data CRC Register */
#define DMA_CH109_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012DA0u)
/** Alias (User Manual Name) for DMA_CH109_RDCRCR.
* To use register names with standard convension, please use DMA_CH109_RDCRCR.
*/
#define DMA_RDCRCR109 (DMA_CH109_RDCRCR)

/** \brief 2DA4, DMARAM Channel 109 Source and Destination Address CRC Register */
#define DMA_CH109_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012DA4u)
/** Alias (User Manual Name) for DMA_CH109_SDCRCR.
* To use register names with standard convension, please use DMA_CH109_SDCRCR.
*/
#define DMA_SDCRCR109 (DMA_CH109_SDCRCR)

/** \brief 2DA8, DMARAM Channel 109 Source Address Register */
#define DMA_CH109_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012DA8u)
/** Alias (User Manual Name) for DMA_CH109_SADR.
* To use register names with standard convension, please use DMA_CH109_SADR.
*/
#define DMA_SADR109 (DMA_CH109_SADR)

/** \brief 2DAC, DMARAM Channel 109 Destination Address Register */
#define DMA_CH109_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012DACu)
/** Alias (User Manual Name) for DMA_CH109_DADR.
* To use register names with standard convension, please use DMA_CH109_DADR.
*/
#define DMA_DADR109 (DMA_CH109_DADR)

/** \brief 2DB0, DMARAM Channel 109 Address and Interrupt Control Register */
#define DMA_CH109_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012DB0u)
/** Alias (User Manual Name) for DMA_CH109_ADICR.
* To use register names with standard convension, please use DMA_CH109_ADICR.
*/
#define DMA_ADICR109 (DMA_CH109_ADICR)

/** \brief 2DB4, DMARAM Channel 109 Configuration Register */
#define DMA_CH109_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012DB4u)
/** Alias (User Manual Name) for DMA_CH109_CHCFGR.
* To use register names with standard convension, please use DMA_CH109_CHCFGR.
*/
#define DMA_CHCFGR109 (DMA_CH109_CHCFGR)

/** \brief 2DB8, DMARAM Channel 109 Shadow Address Register */
#define DMA_CH109_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012DB8u)
/** Alias (User Manual Name) for DMA_CH109_SHADR.
* To use register names with standard convension, please use DMA_CH109_SHADR.
*/
#define DMA_SHADR109 (DMA_CH109_SHADR)

/** \brief 2DBC, DMARAM Channel 109 Control and Status Register */
#define DMA_CH109_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012DBCu)
/** Alias (User Manual Name) for DMA_CH109_CHCSR.
* To use register names with standard convension, please use DMA_CH109_CHCSR.
*/
#define DMA_CHCSR109 (DMA_CH109_CHCSR)

/** \brief 2DC0, DMARAM Channel 110 Read Data CRC Register */
#define DMA_CH110_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012DC0u)
/** Alias (User Manual Name) for DMA_CH110_RDCRCR.
* To use register names with standard convension, please use DMA_CH110_RDCRCR.
*/
#define DMA_RDCRCR110 (DMA_CH110_RDCRCR)

/** \brief 2DC4, DMARAM Channel 110 Source and Destination Address CRC Register */
#define DMA_CH110_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012DC4u)
/** Alias (User Manual Name) for DMA_CH110_SDCRCR.
* To use register names with standard convension, please use DMA_CH110_SDCRCR.
*/
#define DMA_SDCRCR110 (DMA_CH110_SDCRCR)

/** \brief 2DC8, DMARAM Channel 110 Source Address Register */
#define DMA_CH110_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012DC8u)
/** Alias (User Manual Name) for DMA_CH110_SADR.
* To use register names with standard convension, please use DMA_CH110_SADR.
*/
#define DMA_SADR110 (DMA_CH110_SADR)

/** \brief 2DCC, DMARAM Channel 110 Destination Address Register */
#define DMA_CH110_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012DCCu)
/** Alias (User Manual Name) for DMA_CH110_DADR.
* To use register names with standard convension, please use DMA_CH110_DADR.
*/
#define DMA_DADR110 (DMA_CH110_DADR)

/** \brief 2DD0, DMARAM Channel 110 Address and Interrupt Control Register */
#define DMA_CH110_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012DD0u)
/** Alias (User Manual Name) for DMA_CH110_ADICR.
* To use register names with standard convension, please use DMA_CH110_ADICR.
*/
#define DMA_ADICR110 (DMA_CH110_ADICR)

/** \brief 2DD4, DMARAM Channel 110 Configuration Register */
#define DMA_CH110_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012DD4u)
/** Alias (User Manual Name) for DMA_CH110_CHCFGR.
* To use register names with standard convension, please use DMA_CH110_CHCFGR.
*/
#define DMA_CHCFGR110 (DMA_CH110_CHCFGR)

/** \brief 2DD8, DMARAM Channel 110 Shadow Address Register */
#define DMA_CH110_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012DD8u)
/** Alias (User Manual Name) for DMA_CH110_SHADR.
* To use register names with standard convension, please use DMA_CH110_SHADR.
*/
#define DMA_SHADR110 (DMA_CH110_SHADR)

/** \brief 2DDC, DMARAM Channel 110 Control and Status Register */
#define DMA_CH110_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012DDCu)
/** Alias (User Manual Name) for DMA_CH110_CHCSR.
* To use register names with standard convension, please use DMA_CH110_CHCSR.
*/
#define DMA_CHCSR110 (DMA_CH110_CHCSR)

/** \brief 2DE0, DMARAM Channel 111 Read Data CRC Register */
#define DMA_CH111_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012DE0u)
/** Alias (User Manual Name) for DMA_CH111_RDCRCR.
* To use register names with standard convension, please use DMA_CH111_RDCRCR.
*/
#define DMA_RDCRCR111 (DMA_CH111_RDCRCR)

