Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxDma_reg.h
/** \brief 2FA4, DMARAM Channel 125 Source and Destination Address CRC Register */
#define DMA_CH125_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012FA4u)
/** Alias (User Manual Name) for DMA_CH125_SDCRCR.
* To use register names with standard convension, please use DMA_CH125_SDCRCR.
*/
#define DMA_SDCRCR125 (DMA_CH125_SDCRCR)

/** \brief 2FA8, DMARAM Channel 125 Source Address Register */
#define DMA_CH125_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012FA8u)
/** Alias (User Manual Name) for DMA_CH125_SADR.
* To use register names with standard convension, please use DMA_CH125_SADR.
*/
#define DMA_SADR125 (DMA_CH125_SADR)

/** \brief 2FAC, DMARAM Channel 125 Destination Address Register */
#define DMA_CH125_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012FACu)
/** Alias (User Manual Name) for DMA_CH125_DADR.
* To use register names with standard convension, please use DMA_CH125_DADR.
*/
#define DMA_DADR125 (DMA_CH125_DADR)

/** \brief 2FB0, DMARAM Channel 125 Address and Interrupt Control Register */
#define DMA_CH125_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012FB0u)
/** Alias (User Manual Name) for DMA_CH125_ADICR.
* To use register names with standard convension, please use DMA_CH125_ADICR.
*/
#define DMA_ADICR125 (DMA_CH125_ADICR)

/** \brief 2FB4, DMARAM Channel 125 Configuration Register */
#define DMA_CH125_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012FB4u)
/** Alias (User Manual Name) for DMA_CH125_CHCFGR.
* To use register names with standard convension, please use DMA_CH125_CHCFGR.
*/
#define DMA_CHCFGR125 (DMA_CH125_CHCFGR)

/** \brief 2FB8, DMARAM Channel 125 Shadow Address Register */
#define DMA_CH125_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012FB8u)
/** Alias (User Manual Name) for DMA_CH125_SHADR.
* To use register names with standard convension, please use DMA_CH125_SHADR.
*/
#define DMA_SHADR125 (DMA_CH125_SHADR)

/** \brief 2FBC, DMARAM Channel 125 Control and Status Register */
#define DMA_CH125_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012FBCu)
/** Alias (User Manual Name) for DMA_CH125_CHCSR.
* To use register names with standard convension, please use DMA_CH125_CHCSR.
*/
#define DMA_CHCSR125 (DMA_CH125_CHCSR)

/** \brief 2FC0, DMARAM Channel 126 Read Data CRC Register */
#define DMA_CH126_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012FC0u)
/** Alias (User Manual Name) for DMA_CH126_RDCRCR.
* To use register names with standard convension, please use DMA_CH126_RDCRCR.
*/
#define DMA_RDCRCR126 (DMA_CH126_RDCRCR)

/** \brief 2FC4, DMARAM Channel 126 Source and Destination Address CRC Register */
#define DMA_CH126_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012FC4u)
/** Alias (User Manual Name) for DMA_CH126_SDCRCR.
* To use register names with standard convension, please use DMA_CH126_SDCRCR.
*/
#define DMA_SDCRCR126 (DMA_CH126_SDCRCR)

/** \brief 2FC8, DMARAM Channel 126 Source Address Register */
#define DMA_CH126_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012FC8u)
/** Alias (User Manual Name) for DMA_CH126_SADR.
* To use register names with standard convension, please use DMA_CH126_SADR.
*/
#define DMA_SADR126 (DMA_CH126_SADR)

/** \brief 2FCC, DMARAM Channel 126 Destination Address Register */
#define DMA_CH126_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012FCCu)
/** Alias (User Manual Name) for DMA_CH126_DADR.
* To use register names with standard convension, please use DMA_CH126_DADR.
*/
#define DMA_DADR126 (DMA_CH126_DADR)

/** \brief 2FD0, DMARAM Channel 126 Address and Interrupt Control Register */
#define DMA_CH126_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012FD0u)
/** Alias (User Manual Name) for DMA_CH126_ADICR.
* To use register names with standard convension, please use DMA_CH126_ADICR.
*/
#define DMA_ADICR126 (DMA_CH126_ADICR)

/** \brief 2FD4, DMARAM Channel 126 Configuration Register */
#define DMA_CH126_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012FD4u)
/** Alias (User Manual Name) for DMA_CH126_CHCFGR.
* To use register names with standard convension, please use DMA_CH126_CHCFGR.
*/
#define DMA_CHCFGR126 (DMA_CH126_CHCFGR)

/** \brief 2FD8, DMARAM Channel 126 Shadow Address Register */
#define DMA_CH126_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012FD8u)
/** Alias (User Manual Name) for DMA_CH126_SHADR.
* To use register names with standard convension, please use DMA_CH126_SHADR.
*/
#define DMA_SHADR126 (DMA_CH126_SHADR)

/** \brief 2FDC, DMARAM Channel 126 Control and Status Register */
#define DMA_CH126_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012FDCu)
/** Alias (User Manual Name) for DMA_CH126_CHCSR.
* To use register names with standard convension, please use DMA_CH126_CHCSR.
*/
#define DMA_CHCSR126 (DMA_CH126_CHCSR)

/** \brief 2FE0, DMARAM Channel 127 Read Data CRC Register */
#define DMA_CH127_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012FE0u)
/** Alias (User Manual Name) for DMA_CH127_RDCRCR.
* To use register names with standard convension, please use DMA_CH127_RDCRCR.
*/
#define DMA_RDCRCR127 (DMA_CH127_RDCRCR)

/** \brief 2FE4, DMARAM Channel 127 Source and Destination Address CRC Register */
#define DMA_CH127_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012FE4u)
/** Alias (User Manual Name) for DMA_CH127_SDCRCR.
* To use register names with standard convension, please use DMA_CH127_SDCRCR.
*/
#define DMA_SDCRCR127 (DMA_CH127_SDCRCR)

/** \brief 2FE8, DMARAM Channel 127 Source Address Register */
#define DMA_CH127_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012FE8u)
/** Alias (User Manual Name) for DMA_CH127_SADR.
* To use register names with standard convension, please use DMA_CH127_SADR.
*/
#define DMA_SADR127 (DMA_CH127_SADR)

/** \brief 2FEC, DMARAM Channel 127 Destination Address Register */
#define DMA_CH127_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012FECu)
/** Alias (User Manual Name) for DMA_CH127_DADR.
* To use register names with standard convension, please use DMA_CH127_DADR.
*/
#define DMA_DADR127 (DMA_CH127_DADR)

/** \brief 2FF0, DMARAM Channel 127 Address and Interrupt Control Register */
#define DMA_CH127_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012FF0u)
/** Alias (User Manual Name) for DMA_CH127_ADICR.
* To use register names with standard convension, please use DMA_CH127_ADICR.
*/
#define DMA_ADICR127 (DMA_CH127_ADICR)

/** \brief 2FF4, DMARAM Channel 127 Configuration Register */
#define DMA_CH127_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012FF4u)
/** Alias (User Manual Name) for DMA_CH127_CHCFGR.
* To use register names with standard convension, please use DMA_CH127_CHCFGR.
*/
#define DMA_CHCFGR127 (DMA_CH127_CHCFGR)

/** \brief 2FF8, DMARAM Channel 127 Shadow Address Register */
#define DMA_CH127_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012FF8u)
/** Alias (User Manual Name) for DMA_CH127_SHADR.
* To use register names with standard convension, please use DMA_CH127_SHADR.
*/
#define DMA_SHADR127 (DMA_CH127_SHADR)

/** \brief 2FFC, DMARAM Channel 127 Control and Status Register */
#define DMA_CH127_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012FFCu)
/** Alias (User Manual Name) for DMA_CH127_CHCSR.
* To use register names with standard convension, please use DMA_CH127_CHCSR.
*/
#define DMA_CHCSR127 (DMA_CH127_CHCSR)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXDMA_REG_H */
